УТ.КонтурЗакупки/src/DataProcessors/КонтурЗакупки_ИнформацияОЛимитах/КонтурЗакупки_ИнформацияОЛимитах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КонтурЗакупки_ИнформацияОЛимитах</name>
  <tabularSections>
    <name>ИнформацияОЛимитах</name>
    <attributes>
      <name>ГруппаЛимитов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоступноЗапросов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийЛимит</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоПериодический</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УТ.КонтурЗакупки/src/DataProcessors/КонтурЗакупки_ИнформацияОЛимитах/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получение информации о лимитах
// 
// Параметры:
//  ОписаниеРезультата - Строка - Описание результата
// 
// Возвращаемое значение:
//  Булево - Получить информацию о лимитах
Функция ПолучитьИнформациюОЛимитах(ОписаниеРезультата = "") Экспорт
	Результат = Истина;

	РезультатHTTPЗапроса = КонтурЗакупки_httpЗапросыКлиентСервер.http_ПолучитьИнформациюОЛимитах();
	Если РезультатHTTPЗапроса <> Неопределено Тогда
		Если Не РезультатHTTPЗапроса["data"] = Неопределено Тогда
			ДанныеСоответствие = РезультатHTTPЗапроса["data"];
			Если ТипЗнч(ДанныеСоответствие) = Тип("Массив") Тогда
				ЗаполнитьТабличнуюЧастьРезультата(ДанныеСоответствие);
			КонецЕсли;
		ИначеЕсли Не РезультатHTTPЗапроса["error"] = Неопределено И РезультатHTTPЗапроса["error"] = Истина Тогда
			Результат = Ложь;
			ОписаниеРезультата = ОписаниеРезультата + СтрШаблон(
			НСтр("ru = 'Ошибка: %1'"), РезультатHTTPЗапроса["message"]) + Символы.ПС;
		КонецЕсли;
	Иначе
		ОписаниеРезультата = ОписаниеРезультата + НСтр("ru = 'Ошибка'") + Символы.ПС;
	КонецЕсли;

	Возврат Результат;
КонецФункции
#КонецОбласти
#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьТабличнуюЧастьРезультата(ДанныеСоответствие) Экспорт
	ИнформацияОЛимитах.Очистить();
	Для Каждого ЗаписьОЛимитах Из ДанныеСоответствие Цикл
		НовСтрока = ИнформацияОЛимитах.Добавить();
		НовСтрока.ГруппаЛимитов = ЗаписьОЛимитах["LimitGroup"];
		НовСтрока.ДоступноЗапросов = ЗаписьОЛимитах["AvailableRequests"];
		НовСтрока.ОбщийЛимит = ЗаписьОЛимитах["TotalLimit"];
		НовСтрока.ЭтоПериодический = ЗаписьОЛимитах["IsPeriodic"];
	КонецЦикла;
КонецПроцедуры
#КонецОбласти

#КонецЕсли
